In [3]:
import numpy as np
import pandas as pd

#### **Finding missing data**

In [6]:
data={
    'A':[1,2,np.nan,4,5],
    'B':[np.nan,2,3,4,5],
    'C':[1,2,3,np.nan,np.nan],
    'D':[1,np.nan,np.nan,np.nan,5]
}

df=pd.DataFrame(data)
df

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  NaN  5.0

In [12]:
df.isna()

       A      B      C      D
0  False   True  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [20]:
df.isna().sum()
#count of null values

A    1
B    1
C    2
D    3
dtype: int64

In [24]:
df.isna().any()
#check if any null value present in each (deafualt axis=0) can chaneg axis=0 to get any null value in row(google this not sure)

A    True
B    True
C    True
D    True
dtype: bool

#### **Removing missing data**

In [27]:
df

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  NaN  5.0

In [30]:
df.dropna()
#as there are null value in all rows thus every row dropped

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [33]:
df.at[1,'D']=2
df

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  2.0
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  NaN  5.0

In [35]:
df.dropna(thresh=3)
# drop rows having less tha 3 null values

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  2.0
4  5.0  5.0  NaN  5.0

#### **Filling the missing data**

In [36]:
df

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  2.0
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  NaN  5.0

In [37]:
df.fillna(0)

     A    B    C    D
0  1.0  0.0  1.0  1.0
1  2.0  2.0  2.0  2.0
2  0.0  3.0  3.0  0.0
3  4.0  4.0  0.0  0.0
4  5.0  5.0  0.0  5.0

In [38]:
value_list={'A':0,'B':10,'C':100,'D':1000}
df.fillna(value=value_list)

     A     B      C       D
0  1.0  10.0    1.0     1.0
1  2.0   2.0    2.0     2.0
2  0.0   3.0    3.0  1000.0
3  4.0   4.0  100.0  1000.0
4  5.0   5.0  100.0     5.0

In [39]:
df.fillna(df.mean())

     A    B    C         D
0  1.0  3.5  1.0  1.000000
1  2.0  2.0  2.0  2.000000
2  3.0  3.0  3.0  2.666667
3  4.0  4.0  2.0  2.666667
4  5.0  5.0  2.0  5.000000